#### Terraform Format and Style  - `success`
#### Terraform Initialization - `success`
#### Terraform Plan - `success`          

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.remote["current"]: Reading...
data.terraform_remote_state.remote["current"]: Read complete after 1s
module.landingzone.data.azurerm_client_config.current: Reading...
module.landingzone.data.azurerm_subscription.primary: Reading...
module.landingzone.data.azurerm_client_config.current: Read complete after 0s [id=2023-03-20 18:31:16.052340494 +0000 UTC]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Reading...
module.landingzone.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Read complete after 0s [id=2b3020e2-22c9-4b01-b88e-95624dbd2f23]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2023-03-20 18:31:16.389881573 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.landingzone.module.networking["hub_vnet"].azurecaf_name.caf_name_vnet will be created
  + resource "azurecaf_name" "caf_name_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "mm-vnet-hub"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["hub_vnet"].azurerm_subnet_network_security_group_association.nsg_vnet_association["jumpbox"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_vnet_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.landingzone.module.networking["hub_vnet"].azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = []
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = (known after apply)
      + resource_group_name   = (known after apply)
      + subnet                = (known after apply)
      + tags                  = {
          + "module" = "virtual_network"
        }
      + vm_protection_enabled = false
    }

  # module.landingzone.module.resource_groups["hub-rg"].azurecaf_name.rg will be created
  + resource "azurecaf_name" "rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "conn-hub-rg"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.resource_groups["hub-rg"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = (known after apply)
    }

  # module.landingzone.module.networking["hub_vnet"].module.nsg.azurecaf_name.nsg_obj["jumpbox"] will be created
  + resource "azurecaf_name" "nsg_obj" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jumpbox"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["hub_vnet"].module.nsg.azurerm_network_security_group.nsg_obj["jumpbox"] will be created
  + resource "azurerm_network_security_group" "nsg_obj" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = []
      + tags                = {
          + "module" = "virtual_network"
        }
    }

  # module.landingzone.module.networking["hub_vnet"].module.special_subnets["AzureFirewallSubnet"].azurecaf_name.subnet will be created
  + resource "azurecaf_name" "subnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "AzureFirewallSubnet"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["hub_vnet"].module.special_subnets["AzureFirewallSubnet"].azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.2.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = []
      + virtual_network_name                           = (known after apply)
    }

  # module.landingzone.module.networking["hub_vnet"].module.special_subnets["GatewaySubnet"].azurecaf_name.subnet will be created
  + resource "azurecaf_name" "subnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "GatewaySubnet"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["hub_vnet"].module.special_subnets["GatewaySubnet"].azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.1.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = []
      + virtual_network_name                           = (known after apply)
    }

  # module.landingzone.module.networking["hub_vnet"].module.subnets["jumpbox"].azurecaf_name.subnet will be created
  + resource "azurecaf_name" "subnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jumpbox"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["hub_vnet"].module.subnets["jumpbox"].azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = []
      + virtual_network_name                           = (known after apply)
    }

  # module.landingzone.module.networking["hub_vnet"].module.subnets["private_endpoints"].azurecaf_name.subnet will be created
  + resource "azurecaf_name" "subnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "private_endpoints"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["hub_vnet"].module.subnets["private_endpoints"].azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.4.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = []
      + virtual_network_name                           = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + global_settings = (sensitive value)
  + objects         = (sensitive value)
  + tfstates        = (sensitive value)

Warning: Value for undeclared variable

The root module does not declare a variable named
"network_security_group_definition" but a value was found in file
"../../landingzones/core/connectivity/network_security.tfvars". If you meant
to use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Argument is deprecated

  with module.landingzone.module.api_management_custom_domain.azurerm_api_management_custom_domain.apim,
  on ../dvt-caf/modules/apim/api_management_custom_domain/module.tf line 1, in resource "azurerm_api_management_custom_domain" "apim":
   1: resource "azurerm_api_management_custom_domain" "apim" {

`proxy` is deprecated and will be renamed to `gateway` in version 3.0 of the
AzureRM provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @rafaelherik, Action: `pull_request`*